# IsEnabled Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MacroManager..::..IsEnabled Property
MacroManager Class See Also
---
Indicates if macros stored in this MacroManager are enabled.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsEnabled { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsEnabled As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsEnabled {
	bool get ();
}
```

# See Also
MacroManager Class
Autodesk.Revit.DB.Macros Namespace